package hw.hw10;

    public class Vet {
        public void treatAnimal(Animal animal) {
            System.out.println(animal);
        }
    }


//Создайте класс Ветеринар, в котором определите
// метод void treatAnimal(Animal animal). Пусть этот метод распечатывает food и location пришедшего на прием животного